import React from 'react';

// props로 className과 fill을 받아서 사용할 것이다..
// fill에 기본 색상('#000000')을 설정
const SproutLogo = ({ className, fill = '#000000' }) => {
  return (
    <svg
      className={className}
      fill={fill} // props로 받은 색상을 적용합니다.
      viewBox="0 0 38 27"
    >
      {/* sprout.svg 파일의 <path> 코드 */}
      <path d="M12.6,2.2c-0.4-0.4-1.1-0.4-1.5,0L2,11.3c-0.4,0.4-0.4,1.1,0,1.5l1.9,1.9c0.4,0.4,1.1,0.4,1.5,0l1.2-1.2l-3.3-3.3l6.5-6.5C12,2.7,12.3,2.2,12.6,2.2z M21.9,11.3l-9.1-9.1c-0.4-0.4-1.1-0.4-1.5,0l-1.9,1.9c-0.4,0.4-0.4,1.1,0,1.5l1.2,1.2l-3.3,3.3l6.5,6.5c0.4,0.4,1.1,0.4,1.5,0l1.9-1.9c0.4-0.4,0.4-1.1,0-1.5l-1.2-1.2l3.3-3.3l-6.5-6.5C12,2.7,12.3,2.2,12.6,2.2z" />
    </svg>
  );
};

export default SproutLogo;